In [1]:
%load_ext sql
%sql sqlite://

In [2]:
%%sql
DROP TABLE IF EXISTS t1;
DROP TABLE IF EXISTS t2;
CREATE TABLE t1 (col_a varchar(10), col_b int);
CREATE TABLE t2 (col_c varchar(10), col_d int);
INSERT INTO t1 VALUES
("abc", 1),
("def", 2),
("ghi", 3);
INSERT INTO t2 VALUES
("abc", 3),
("def", 2);

 * sqlite://
Done.
Done.
Done.
Done.
3 rows affected.
2 rows affected.

[]

In [3]:
%%sql
SELECT * FROM t1

 * sqlite://
Done.

[('abc', 1), ('def', 2), ('ghi', 3)]

In [4]:
%%sql
SELECT * FROM t2

 * sqlite://
Done.

[('abc', 3), ('def', 2)]

In [5]:
%%sql
SELECT * FROM t1
UNION
SELECT * FROM t2

 * sqlite://
Done.

[('abc', 1), ('abc', 3), ('def', 2), ('ghi', 3)]

In [6]:
%%sql
SELECT * FROM t1
INTERSECT
SELECT * FROM t2

 * sqlite://
Done.

[('def', 2)]

In [7]:
%%sql
SELECT * FROM t1
EXCEPT
SELECT * FROM t2

 * sqlite://
Done.

[('abc', 1), ('ghi', 3)]

In [8]:
%%sql
SELECT col_a FROM t1
UNION
SELECT col_c, col_d FROM t2

 * sqlite://
(sqlite3.OperationalError) SELECTs to the left and right of UNION do not have the same number of result columns
[SQL: SELECT col_a FROM t1
UNION
SELECT col_c, col_d FROM t2]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [9]:
%%sql
SELECT * FROM t1, t2

 * sqlite://
Done.

[('abc', 1, 'abc', 3),
 ('abc', 1, 'def', 2),
 ('def', 2, 'abc', 3),
 ('def', 2, 'def', 2),
 ('ghi', 3, 'abc', 3),
 ('ghi', 3, 'def', 2)]

In [10]:
%%sql
SELECT col_a, col_d FROM t1, t2

 * sqlite://
Done.

[('abc', 3), ('abc', 2), ('def', 3), ('def', 2), ('ghi', 3), ('ghi', 2)]